
import { GameData } from "./gemini";

export const fallbackGame: GameData = {
    rounds: [
        {
            name: "Раунд 1",
            categories: [
                {
                    title: "Программирование",
                    questions: [
                        { text: "Этот язык программирования назван в честь драгоценного камня.", answer: "Ruby", value: 100 },
                        { text: "В этом языке массивы начинаются с 1 (шутка, с 0). Но в Lua с 1.", answer: "Lua", value: 200 },
                        { text: "Как называется процесс поиска и исправления ошибок в коде?", answer: "Дебаггинг (Отладка)", value: 300 },
                        { text: "Назовите маскота операционной системы Linux.", answer: "Пингвин Такс (Tux)", value: 400 },
                        { text: "Какой символ используется для комментариев в Python?", answer: "Решетка (#)", value: 500 },
                    ],
                },
                {
                    title: "Кино",
                    questions: [
                        { text: "Как звали главного героя в фильме 'Матрица'?", answer: "Нео", value: 100 },
                        { text: "В каком сериале драконы были главным оружием?", answer: "Игра Престолов", value: 200 },
                        { text: "Кто сказал фразу 'I'll be back'?", answer: "Терминатор", value: 300 },
                        { text: "Фильм Кристофера Нолана про сны внутри снов.", answer: "Начало (Inception)", value: 400 },
                        { text: "Как зовут зеленого магистра джедая?", answer: "Йода", value: 500 },
                    ],
                },
                {
                    title: "Еда",
                    questions: [
                        { text: "Итальянское блюдо из теста и сыра.", answer: "Пицца", value: 100 },
                        { text: "Японский рулетик с рисом.", answer: "Роллы", value: 200 },
                        { text: "Из чего делают попкорн?", answer: "Кукуруза", value: 300 },
                        { text: "Какой фрукт называют 'золотым яблоком'?", answer: "Помидор", value: 400 },
                        { text: "Грузинский пирог с сыром.", answer: "Хачапури", value: 500 },
                    ],
                },
                {
                    title: "Животные",
                    questions: [
                        { text: "Самое быстрое наземное животное.", answer: "Гепард", value: 100 },
                        { text: "Кто спит вниз головой?", answer: "Летучая мышь", value: 200 },
                        { text: "Самое большое млекопитающее.", answer: "Синий кит", value: 300 },
                        { text: "Птица, которая не умеет летать, но быстро бегает.", answer: "Страус", value: 400 },
                        { text: "Единственное млекопитающее, умеющее летать.", answer: "Летучая мышь", value: 500 },
                    ],
                },
                {
                    title: "Спорт",
                    questions: [
                        { text: "Как называется игра с мячом на льду?", answer: "Хоккей", value: 100 },
                        { text: "Сколько игроков в футбольной команде на поле?", answer: "11", value: 200 },
                        { text: "В какой игре используют ракетку и волан?", answer: "Бадминтон", value: 300 },
                        { text: "Король спорта.", answer: "Футбол", value: 400 },
                        { text: "Сколько колец на олимпийском флаге?", answer: "5", value: 500 },
                    ],
                }
            ],
        },
        {
            name: "Раунд 2",
            categories: [
                {
                    title: "История",
                    questions: [
                        { text: "Первый президент США.", answer: "Джордж Вашингтон", value: 200 },
                        { text: "В каком году началась Вторая мировая война?", answer: "1939", value: 400 },
                        { text: "Кто открыл Америку?", answer: "Колумб", value: 600 },
                        { text: "Кто воевал с Кутузовым?", answer: "Наполеон", value: 800 },
                        { text: "Древнеримский полководец, убитый в сенате.", answer: "Цезарь", value: 1000 },
                    ],
                },
                {
                    title: "География",
                    questions: [
                        { text: "Самый большой материк.", answer: "Евразия", value: 200 },
                        { text: "Столица Японии.", answer: "Токио", value: 400 },
                        { text: "В какой стране находятся пирамиды Хеопса?", answer: "Египет", value: 600 },
                        { text: "Самый глубокий океан.", answer: "Тихий", value: 800 },
                        { text: "Где находится Биг Бен?", answer: "Лондон", value: 1000 },
                    ],
                },
                {
                    title: "Литература",
                    questions: [
                        { text: "Кто написал 'Войну и мир'?", answer: "Лев Толстой", value: 200 },
                        { text: "Имя сыщика с Бейкер-стрит.", answer: "Шерлок Холмс", value: 400 },
                        { text: "Автор 'Гарри Поттера'.", answer: "Джоан Роулинг", value: 600 },
                        { text: "Поэт, погибший на дуэли.", answer: "Александр Пушкин", value: 800 },
                        { text: "Кто написал 'Преступление и наказание'?", answer: "Достоевский", value: 1000 },
                    ],
                },
                {
                    title: "Музыка",
                    questions: [
                        { text: "Король поп-музыки.", answer: "Майкл Джексон", value: 200 },
                        { text: "Ливерпульская четверка.", answer: "The Beatles", value: 400 },
                        { text: "Сколько струн у классической гитары?", answer: "6", value: 600 },
                        { text: "Кто написал 'Лунную сонату'?", answer: "Бетховен", value: 800 },
                        { text: "Жанр музыки, зародившийся в Новом Орлеане.", answer: "Джаз", value: 1000 },
                    ],
                },
                {
                    title: "Технологии",
                    questions: [
                        { text: "Основатель компании Microsoft.", answer: "Билл Гейтс", value: 200 },
                        { text: "Социальная сеть Марка Цукерберга.", answer: "Facebook", value: 400 },
                        { text: "Как называется 'яблочная' компания?", answer: "Apple", value: 600 },
                        { text: "Робот-пылесос - это пример чего?", answer: "Умного дома / IoT", value: 800 },
                        { text: "Валюта интернета.", answer: "Биткоин (Криптовалюта)", value: 1000 },
                    ],
                }
            ]
        },
        {
            name: "Раунд 3",
            categories: [
                {
                    title: "Наука",
                    questions: [
                        { text: "Самая близкая к Солнцу планета.", answer: "Меркурий", value: 300 },
                        { text: "Формула спирта (этанола).", answer: "C2H5OH", value: 600 },
                        { text: "Кто открыл закон тяготения?", answer: "Ньютон", value: 900 },
                        { text: "Единица измерения силы тока.", answer: "Ампер", value: 1200 },
                        { text: "Температура абсолютного нуля по Цельсию.", answer: "-273.15", value: 1500 },
                    ]
                },
                {
                    title: "Космос",
                    questions: [
                        { text: "Первый человек в космосе.", answer: "Юрий Гагарин", value: 300 },
                        { text: "Красная планета.", answer: "Марс", value: 600 },
                        { text: "Самая большая планета Солнечной системы.", answer: "Юпитер", value: 900 },
                        { text: "Галактика, в которой мы живем.", answer: "Млечный Путь", value: 1200 },
                        { text: "Спутник Земли.", answer: "Луна", value: 1500 },
                    ]
                },
                {
                    title: "Искусство",
                    questions: [
                        { text: "Кто написал 'Мона Лизу'?", answer: "Леонардо да Винчи", value: 300 },
                        { text: "Автор картины 'Звездная ночь'.", answer: "Ван Гог", value: 600 },
                        { text: "Самый известный русский балет.", answer: "Лебединое озеро", value: 900 },
                        { text: "Бог искусства в Греции.", answer: "Аполлон", value: 1200 },
                        { text: "Скульптура без рук.", answer: "Венера Милосская", value: 1500 },
                    ]
                },
                {
                    title: "Сказки",
                    questions: [
                        { text: "Кто потерял хрустальную туфельку?", answer: "Золушка", value: 300 },
                        { text: "Девочка, провалившаяся в кроличью нору.", answer: "Алиса", value: 600 },
                        { text: "Мальчик, который не хотел взрослеть.", answer: "Питер Пэн", value: 900 },
                        { text: "Кто съел колобка?", answer: "Лиса", value: 1200 },
                        { text: "Злодей, смерть которого в игле.", answer: "Кощей Бессмертный", value: 1500 },
                    ]
                },
                {
                    title: "Разное",
                    questions: [
                        { text: "Столица Франции.", answer: "Париж", value: 300 },
                        { text: "Сколько дней в году?", answer: "365", value: 600 },
                        { text: "Цвет надежды.", answer: "Зеленый", value: 900 },
                        { text: "Самый твердый минерал.", answer: "Алмаз", value: 1200 },
                        { text: "Жидкость жизни.", answer: "Вода", value: 1500 },
                    ]
                }
            ]
        },
        {
            name: "Финал",
            type: "final",
            categories: [
                {
                    title: "Секретная Тема",
                    questions: [
                        { text: "Что находится в черном ящике? (Шутка). Назовите столицу Австралии.", answer: "Канберра", value: 0 }
                    ]
                }
            ]
        }
    ],
};
